let sen = document.getElementById("sen");
let totoro = document.getElementById("totoro");
let kiki = document.getElementById("kiki");

let sen_obj = {
    movie : "센과 치히로의 행방불명",
    summary : "시골로 이사를 가게 된 치히로의 가족. 여느 아이들과 달리 겁이 많고 소심하지만 심지는 굳은 소녀 치히로는 이 날도 무료함에 젖어 있었다. 그런데 하필이면 길을 잘못 드는 바람에 의문의 터널 앞에 도착하고 그 곳을 지나자마자 신령의 세계로 들어오게 되었다. 그곳에는 거의 폐허가 되어 공터만 남은 어느 유원지가 있었다. 부모님은 원래 목적지를 잊었는지 무언가에 홀린듯 안으로 들어갔고 맛있는 냄새를 풍기는 어느 음식점을 발견하여 주인을 찾지만 아무도 없자 허락도 구하지 않고 음식을 마구 먹는다. 치히로는 분명히 주인이 있다고 생각하여 음식에 입을 대지 않고 부모를 말리지만 아빠는 돈도 있고 카드도 있으니 걱정말라고 한다. 그 모습에 질린 치히로는 여기저기 돌아다니다가 기묘한 여관을 발견하고 다가간다. 그때 하쿠라는 낯선 소년이 나타나 어두워지기 전에 돌아가라고 경고하고 여관에 불이 켜지자 내가 시간을 벌 테니까 무조건 강으로 뛰어!라고 말한다. 치히로는 강으로 달려가다가 부모님을 떠올리고 음식점으로 돌아오지만 두 사람은 이미 돼지로 변해 있었고, 이를 보고 경악한 치히로는 그 자리에서 도망친다. 그 와중에 주변은 점차 밤이 되어 어두워지고 사방에서 이상한 존재들이 계속 나타난다. 오던 길로 돌아가려 해도 부모님과 지나왔던 들판은 이미 강으로 변해있었고, 이상한 존재들이 점점 더 많이 나타나기 시작하며 자신의 몸이 투명해지기까지 하는 상황에 패닉에 빠지지만 하쿠가 이 세계의 음식을 먹여 원래의 상태로 돌려놓는다. 이후 하쿠의 도움으로 여관에 잠입하는데, 그곳에서 온천장의 주인인 유바바와 계약을 맺고 온천장에서 일해야 부모님과 함께 원래의 세계로 돌아갈 수 있는 방법을 찾을 수 있다는 조언을 듣는다. 하쿠가 알려준 가마 할아범과 여직원 린의 도움으로 유바바를 찾아간 치히로는 무작정 이곳에서 일하게 해달라고 하고, 쓸모없는 인간 여자 아이를 왜 받아주겠냐며 협박하는 유바바의 모습에 겁에 질린다. 하지만 운 좋게도 떼를 쓰며 울어대는 아들 보우를 달래느라 정신이 없어진 유바바로부터 계약을 받아내는데, 이 과정에서 유바바에게 자신의 이름을 빼앗겨 '센'으로 개명된다. 이후 린과 함께 온천 종업원으로 일하게 된다. 하쿠가 자신을 불러내어 돼지로 변한 부모님을 만나게 해주고, 치히로가 친구에게 받은 이별 편지를 돌려주며 이름을 되찾아 주고, 그가 주는 주먹밥을 먹으며 닭똥같은 눈물을 폭포수 처럼 쏟는다. 이때 하쿠가 치히로의 이름을 기억하지만 정작 자신의 본명은 잊어버렸다는 것을 알게 된다. 이후 종업원으로 일하게 된 첫날에 찾아온 어느 거대 오물신에 목욕 시중을들며 약수로 씻어내다가 모든 온천탕 직원들과 함께 그에게 쌓여있던 온갖 쓰레기더미를 빼내주는 활약을 하는등 신들의 세계에서의 수많은 기상천외한 새로운 모험들을 겪으며 점차 성장해 나가기 시작하는데......"
}
let totoro_obj = {
    movie : "이웃집 토토로",
    summary : "1952년 일본의 아름다운 시골 마을. 상냥하고 의젓한 11살 초등학교 4학년생 사츠키와 장난꾸러기에 호기심 많은 4살의 메이는 사이좋은 자매로 아빠와 함께 도시를 떠나 시골로 이사온다. 자상한 아빠 쿠사카베 타츠오는 도쿄의 대학 연구원이며, 입원 중이지만 따뜻한 미소를 잃지 않는 엄마가 있다. 곧 퇴원하실 엄마를 공기가 맑은 곳에서 맞이하기 위해 이사를 온 것이다. 숲 한복판에 금방이라도 쓰러질 것처럼 낡은 집을 보며 자매는 새로운 환경에 대한 호기심으로 잔뜩 들뜬다. 사츠키가 학교에 간 뒤, 혼자 숲에서 놀고 있던 메이는 눈 앞을 지나가는 조그맣고 이상한 동물을 발견한다. 그리고 뒤를 쫓아 숲속으로 들어가는데... 미로처럼 꼬불꼬불한 길을 따라가다 큰 나무 밑둥으로 떨어지는 메이. 그곳에서 메이는 도토리 나무의 요정인 토토로를 만난다. 메이는 사츠키가 돌아오자마자 토토로를 만난 것을 자랑하지만 사츠키는 믿지 않는다. 그러나 비가 몹시 쏟아지던 날, 정류장에서 우산을 들고 아빠를 기다리다가 사츠키도 토토로를 만나게 된다. 비를 맞는 토토로에게 우산을 빌려주자 토토로는 답례로 도토리 씨앗을 건넨다. 토토로와의 만남으로 행복감에 부풀어있는 사츠키와 메이. 그러나 그때 병원에서 어머니의 퇴원이 연기되었다는 전보가 온다. 불안해하는 메이는 혼자 엄마를 찾아 병원으로 떠났다가 길을 잃는다. 온 동네를 뒤졌지만 메이는 흔적조차 없고 저수지에선 어린 여자아이의 샌들이 발견된다. 사츠키는 메이를 찾기 위해 애타게 토토로를 부르는데..."
}
let kiki_obj = {
    movie : "마녀 배달부 키키",
    summary : "13세가 된 견습 마녀는 어엿한 마녀가 되기 위해서 다른 마을에 가서 1년 동안 부모를 떠나 자립해서 수행해야 하는데, 마침 키키가 13세가 되자 마을을 찾아 여행을 떠나고, 커다란 마을에 도착한다. 하지만 그곳에 마녀를 반겨주는 사람은 없었고 키키는 풀죽어 마을을 헤매다 마음씨 좋은 빵집 주인 오소노를 만나고 그 곳에서 살면서 마녀의 빗자루 타는 능력을 활용해 택배 사업을 시작한다. 한편, 하늘을 나는 것에 관심이 많은 소년 톰보와 자상한 성격의 할머니, 자유분방한 소녀화가 우르술라등을 만나면서 키키는 점점 성장해 나가는데…"
}

function chihiro() {
    totoro.innerHTML = "";
    kiki.innerHTML = "";
    sen.innerHTML = "<h1>" + sen_obj.movie + "</h1>" + 
        "<div>" + sen_obj.summary + "</div>";
}
function Ntotoro() {
    totoro.innerHTML = "<h1>" + totoro_obj.movie + "</h1>" + 
        "<div>" + totoro_obj.summary + "</div>";
    kiki.innerHTML = "";
    sen.innerHTML = "";
}
function kiki_delivery() {
    totoro.innerHTML = "";
    kiki.innerHTML = "<h1>" + kiki_obj.movie + "</h1>" + 
        "<div>" + kiki_obj.summary + "</div>";
    sen.innerHTML = "";
}